In [1]:
import pandas as pd
import numpy as np

In [2]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6],index=['d','b','a','c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [4]:
obj.reindex(['a','b','c','d'])

a   -5.3
b    7.2
c    3.6
d    4.5
dtype: float64

In [5]:
obj.reindex(['a','b','c'])

a   -5.3
b    7.2
c    3.6
dtype: float64

In [6]:
frame=pd.DataFrame(np.arange(9).reshape(3,3), 
             index=['a','b','c'], 
             columns=['台北', '台中', '高雄'])
frame

   台北  台中  高雄
a   0   1   2
b   3   4   5
c   6   7   8

In [7]:
frame.reindex(['a','b'])

   台北  台中  高雄
a   0   1   2
b   3   4   5

In [9]:
frame.reindex(['a','b'],columns=['台北','高雄'])

   台北  高雄
a   0   2
b   3   5

In [10]:
#drop()
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [11]:
obj.drop('c')

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [13]:
obj.drop(['c', 'd'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [14]:
data = pd.DataFrame(np.arange(16).reshape(4,4),
                   index=['台北','台中', '台南', '高雄'],
                   columns=['one', 'two', 'three', 'four'])
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [15]:
data.drop(['台北','台中'])

    one  two  three  four
台南    8    9     10    11
高雄   12   13     14    15

In [16]:
data.drop(['one','two'],axis=1)

    three  four
台北      2     3
台中      6     7
台南     10    11
高雄     14    15

In [17]:
data.drop(index=['台北','台中'],columns=['one','two'])

    three  four
台南     10    11
高雄     14    15

In [19]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [20]:
obj['c']

2.0

In [21]:
obj[0:2]

a    0.0
b    1.0
dtype: float64

In [22]:
obj[['a','b','c']]

a    0.0
b    1.0
c    2.0
dtype: float64

In [23]:
obj[obj>=1]

b    1.0
c    2.0
d    3.0
dtype: float64

In [25]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['台北','台中','台南', '高雄'],
                   columns=['one', 'two', 'three', 'four'])
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [26]:
data['one']

台北     0
台中     4
台南     8
高雄    12
Name: one, dtype: int64

In [27]:
data[['one','two']]

    one  two
台北    0    1
台中    4    5
台南    8    9
高雄   12   13

In [28]:
data[0:2]

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7

In [29]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['台北','台中','台南', '高雄'],
                   columns=['one', 'two', 'three', 'four'])
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [30]:
data.loc['台北',['one','two','three']]

one      0
two      1
three    2
Name: 台北, dtype: int64

In [31]:
data.iloc[0,0:3]

one      0
two      1
three    2
Name: 台北, dtype: int64

In [32]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: 台南, dtype: int64

In [33]:
data.iloc[[1,2],[3, 0, 1]]

    four  one  two
台中     7    4    5
台南    11    8    9